#### Terraform Format and Style 🖌`success`
#### Terraform Linter ☑️`success`
#### Checkov 👮‍️`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
module.cdn_certificate.aws_acm_certificate.default: Refreshing state... [id=arn:aws:acm:us-east-1:773224345969:certificate/2d40db01-2075-46df-bd9c-33900d352bc1]
module.remote-state-s3-backend.module.remote_state.aws_kms_key.this: Refreshing state... [id=18bf1c92-6ff5-4ff0-b338-12f111ec4056]
module.remote-state-s3-backend.module.remote_state.aws_iam_role.replication[0]: Refreshing state... [id=tf-remote-state-replication-role20220313213332982600000001]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.cdn_certificate_regional.aws_acm_certificate.default: Refreshing state... [id=arn:aws:acm:eu-central-1:773224345969:certificate/70df72ed-6e2f-4849-a209-9d49cf289733]
module.remote-state-s3-backend.module.remote_state.aws_kms_key.replica[0]: Refreshing state... [id=407d7624-76cf-4bef-8cd2-3e98fdc49b06]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_dynamodb_table.lock: Refreshing state... [id=tf-remote-state-lock]
module.cdn_with_s3_bucket.aws_cloudfront_origin_access_identity.default: Refreshing state... [id=E2O5C6PV3OYY5A]
module.redirect.aws_s3_bucket_website_configuration.default: Refreshing state... [id=copotrzebne.pl]
module.hosting_zone.aws_route53_zone.default: Refreshing state... [id=Z069677928IRZ1DEOYQ5K]
module.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c0da428cb60df41e]
module.container_repository.aws_ecr_repository.container_repository: Refreshing state... [id=copotrzebne-container-repository]
module.redirect.aws_s3_bucket.default: Refreshing state... [id=copotrzebne.pl]
module.container_orchestrator.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-central-1:773224345969:cluster/copotrzebne-ecs]
module.cdn_with_s3_bucket.aws_s3_bucket.default: Refreshing state... [id=www.copotrzebne.pl]
module.app_api.aws_cloudwatch_log_group.default: Refreshing state... [id=copotrzebne-api]
module.redirect.aws_s3_bucket_acl.default: Refreshing state... [id=copotrzebne.pl,public-read]
module.cdn_with_s3_bucket.aws_iam_user.deployer: Refreshing state... [id=ci-s3-website-deployer]
module.app_api.aws_ecs_task_definition.default: Refreshing state... [id=service-copotrzebne-api]
module.container_orchestrator.module.launch_template.aws_iam_role.ecs_instance_role: Refreshing state... [id=ecs-instance-role-copotrzebne-ecs-lt]
module.cdn_with_s3_bucket.aws_iam_access_key.deployer_access_key: Refreshing state... [id=AKIA3IB6DGFY7CZ4Q4IU]
module.cdn_certificate_regional.aws_route53_record.default["*.copotrzebne.pl"]: Refreshing state... [id=Z069677928IRZ1DEOYQ5K__8f9b6b3a14cf4030a072f5f919b4cc67.copotrzebne.pl._CNAME]
module.cdn_certificate_regional.aws_route53_record.default["copotrzebne.pl"]: Refreshing state... [id=Z069677928IRZ1DEOYQ5K__8f9b6b3a14cf4030a072f5f919b4cc67.copotrzebne.pl._CNAME]
module.cdn_certificate.aws_route53_record.default["*.copotrzebne.pl"]: Refreshing state... [id=Z069677928IRZ1DEOYQ5K__8f9b6b3a14cf4030a072f5f919b4cc67.copotrzebne.pl._CNAME]
module.cdn_certificate.aws_route53_record.default["copotrzebne.pl"]: Refreshing state... [id=Z069677928IRZ1DEOYQ5K__8f9b6b3a14cf4030a072f5f919b4cc67.copotrzebne.pl._CNAME]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_server_side_encryption_configuration.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_lifecycle_configuration.state[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_versioning.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_public_access_block.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_iam_policy.terraform[0]: Refreshing state... [id=arn:aws:iam::773224345969:policy/terraform20220313213352666600000003]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_acl.state: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1,private]
module.container_orchestrator.module.launch_template.aws_iam_instance_profile.ecs_instance_profile: Refreshing state... [id=ecsInstanceRole-copotrzebne-ecs-lt]
module.container_orchestrator.module.launch_template.aws_iam_role_policy_attachment.ecs_instance_role_policy: Refreshing state... [id=ecs-instance-role-copotrzebne-ecs-lt-20220319101827145300000001]
module.cdn_certificate_regional.aws_acm_certificate_validation.default: Refreshing state... [id=2022-03-20 16:31:47.709 +0000 UTC]
module.cdn_certificate.aws_acm_certificate_validation.default: Refreshing state... [id=2022-03-14 11:00:16.74 +0000 UTC]
module.network.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-06dc00578a9e8ad0e]
module.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0dc22aa0ca8813784]
module.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ca9f6c6212cb3e04]
module.network.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a5e87f3565c7df2a]
module.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bcbf3c26e7a91cae]
module.network.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0ffb48beffb1bd9b6]
module.network.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0daa6ee62711fd7ba]
module.network.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-003923e88d885384c]
module.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05e09846c3422dabf]
module.network.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c7c487fa57e03388]
module.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-087e92d7c75eeceea]
module.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02570465fd3db0a3f]
module.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05874fb8c8da09d57]
module.network.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-028ad6764f9d229bf]
module.rds.aws_security_group.api: Refreshing state... [id=sg-03be97d22a4453f44]
module.app_api.aws_lb_target_group.default: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:773224345969:targetgroup/tg-copotrzebne-api/042a78900c8cca26]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_versioning.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_policy.state_force_ssl: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_server_side_encryption_configuration.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_iam_policy.replication[0]: Refreshing state... [id=arn:aws:iam::773224345969:policy/tf-remote-state-replication-policy20220313213341970900000002]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_lifecycle_configuration.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_acl.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica,private]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_public_access_block.replica[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0dc22aa0ca88137841080289494]
module.cdn_with_s3_bucket.aws_cloudfront_distribution.default: Refreshing state... [id=E279C1CJNYSVZY]
module.cdn_with_s3_bucket.aws_s3_bucket_acl.default: Refreshing state... [id=www.copotrzebne.pl,private]
module.cdn_with_s3_bucket.aws_s3_bucket_public_access_block.default: Refreshing state... [id=www.copotrzebne.pl]
module.network.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0efca78ddd7e6b227]
module.network.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0de32b8951a74afed]
module.network.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0de499a970389ed29]
module.network.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=copotrzebne-network]
module.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dd7f4d71d61278b4]
module.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a2ea76866b42512b]
module.network.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-089cb48b1141c6f14]
module.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c20f47c7dc469f5a]
module.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b024057d1c732116]
module.network.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d8f3cd84c3c80cd2]
module.remote-state-s3-backend.module.remote_state.aws_iam_policy_attachment.replication[0]: Refreshing state... [id=tf-iam-role-attachment-replication-configuration]
module.cdn_with_s3_bucket.aws_s3_bucket_policy.default: Refreshing state... [id=www.copotrzebne.pl]
module.redirect.aws_cloudfront_distribution.default: Refreshing state... [id=EBILQA53T25SK]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_policy.replica_force_ssl[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1-replica]
module.cdn_with_s3_bucket.aws_route53_record.default: Refreshing state... [id=Z069677928IRZ1DEOYQ5K_www.copotrzebne.pl_A]
module.app_api.aws_ecs_service.default: Refreshing state... [id=arn:aws:ecs:eu-central-1:773224345969:service/copotrzebne-ecs/service-copotrzebne-api]
module.load_balancer.aws_security_group.default: Refreshing state... [id=sg-03e116fa7ef305d6c]
module.cdn_with_s3_bucket.aws_iam_user_policy.deployer_policy: Refreshing state... [id=ci-s3-website-deployer:ci-s3-website-deployer]
module.remote-state-s3-backend.module.remote_state.aws_s3_bucket_replication_configuration.state[0]: Refreshing state... [id=terraform-remote-state-773224345969-eu-central-1]
module.container_orchestrator.module.launch_template.aws_launch_template.ec2_launch_template: Refreshing state... [id=lt-07f49ae671584a50d]
module.redirect.aws_route53_record.default: Refreshing state... [id=Z069677928IRZ1DEOYQ5K_copotrzebne.pl_A]
module.load_balancer.aws_lb.default: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:773224345969:loadbalancer/app/copotrzebne-default-alb/bbbefce9ce73b275]
module.rds.aws_db_instance.default: Refreshing state... [id=copotrzebne-master]
module.container_orchestrator.aws_autoscaling_group.ec2_autoscaling: Refreshing state... [id=copotrzebne-ecs-asg]
module.load_balancer.aws_lb_listener.default: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:773224345969:listener/app/copotrzebne-default-alb/bbbefce9ce73b275/815b2d62050cad38]
module.load_balancer.aws_lb_listener.redirect_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:773224345969:listener/app/copotrzebne-default-alb/bbbefce9ce73b275/3f2349c83bf7c9f0]
module.load_balancer.aws_route53_record.default: Refreshing state... [id=Z069677928IRZ1DEOYQ5K_api.copotrzebne.pl_A]
module.container_orchestrator.aws_ecs_capacity_provider.ec2_provider: Refreshing state... [id=arn:aws:ecs:eu-central-1:773224345969:capacity-provider/copotrzebne-ecs-ec2-capacity-provider]
module.container_orchestrator.aws_ecs_cluster_capacity_providers.ec2_providers: Refreshing state... [id=copotrzebne-ecs]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.app_api.aws_ecs_service.default has changed
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:eu-central-1:773224345969:service/copotrzebne-ecs/service-copotrzebne-api"
        name                               = "service-copotrzebne-api"
      + tags                               = {}
        # (13 unchanged attributes hidden)

      + capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "copotrzebne-ecs-ec2-capacity-provider"
          + weight            = 100
        }



        # (3 unchanged blocks hidden)
    }

  # module.rds.aws_db_instance.default has changed
  ~ resource "aws_db_instance" "default" {
        id                                    = "copotrzebne-master"
      ~ latest_restorable_time                = "2022-03-21T07:39:34Z" -> "2022-04-04T00:19:40Z"
        name                                  = "copotrzebne"
        tags                                  = {}
        # (57 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app_api.aws_ecs_service.default must be replaced
-/+ resource "aws_ecs_service" "default" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:eu-central-1:773224345969:service/copotrzebne-ecs/service-copotrzebne-api" -> (known after apply)
      + launch_type                        = (known after apply)
        name                               = "service-copotrzebne-api"
      + platform_version                   = (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
        # (10 unchanged attributes hidden)

      - capacity_provider_strategy { # forces replacement
          - base              = 0 -> null
          - capacity_provider = "copotrzebne-ecs-ec2-capacity-provider" -> null
          - weight            = 100 -> null
        }

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.container_repository.aws_ecr_lifecycle_policy.expire will be created
  + resource "aws_ecr_lifecycle_policy" "expire" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire images older than 1 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "copotrzebne-container-repository"
    }

  # module.container_repository.aws_ecr_lifecycle_policy.keep will be created
  + resource "aws_ecr_lifecycle_policy" "keep" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 2 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 2
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "copotrzebne-container-repository"
    }

  # module.container_orchestrator.module.launch_template.aws_launch_template.ec2_launch_template will be updated in-place
  ~ resource "aws_launch_template" "ec2_launch_template" {
        id                                   = "lt-07f49ae671584a50d"
      ~ image_id                             = (sensitive)
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "copotrzebne-ecs-lt"
        tags                                 = {}
        # (15 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pusher: @tciesek, Action: `pull_request`*